This might be related https://stackoverflow.com/a/53183325.

I created my flow log through the console and imported it. `terraform plan` shows: 
```
  # module.network.aws_flow_log.vpc must be replaced
-/+ resource "aws_flow_log" "vpc" {
      ~ arn                      = "arn:aws:ec2:us-east-2:123456789:vpc-flow-log/fl-0751b9c0b4d94da72" -> (known after apply)
      ~ id                       = "fl-0751b9c0b4d94da72" -> (known after apply)
      + log_destination          = "arn:aws:logs:us-east-2:123456789:log-group:/aws/vpc/dev-primary" # forces replacement
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      ~ log_group_name           = "/aws/vpc/dev-primary" -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
If I instead specify the deprecated `log_group_name` argument instead of `log_destination`, `terraform plan` gives me a deprecation warning but says the configuration matches.